# PercStrFromDeg

## Description
Converts slope from degrees to percent string.

```pascal
FUNCTION PercStrFromDeg(fSlopeDeg : REAL) : STRING;
```

```python

def vs.PercStrFromDeg(fSlopeDeg):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fSlopeDeg|REAL||

## Version
Availability: from Vectorworks 2016
## Category
* SiteModel Interface Library